Repository: cakephp-fr/locale-2.x
Catalog: fra/LC_MESSAGES/cake_dev.po
Languages: fr

source: CakePHP: the rapid development php framework
fr: CakePHP : le framework de développement rapide php

source: Release Notes for CakePHP %s.
fr: Notes de version pour CakePHP %s.

source: Read the changelog
fr: Lire le registre des changements

source: URL rewriting is not properly configured on your server.
fr: La réécriture d'URL n'est pas correctement configurée sur votre serveur.

source: Your version of PHP is 5.2.8 or higher.
fr: Votre version de PHP est égale ou supérieure à 5.2.8.

source: Your version of PHP is too low. You need PHP 5.2.8 or higher to use CakePHP.
fr: Votre version de PHP est trop basse. Vous avez besoin de la version 5.2.8 ou plus pour utiliser CakePHP.

source: Your tmp directory is writable.
fr: Votre dossier tmp est inscriptible.

source: Your tmp directory is NOT writable.
fr: Votre dossier temp n'est PAS inscriptible.

source: The %s is being used for core caching. To change the config edit %s
fr: %s est utilisé pour la mise en cache du noyau. Pour changer la configuration, modifiez %s

source: Your cache is NOT working. Please check the settings in %s
fr: La mise en cache n'est PAS fonctionelle. Veuillez vérifier les paramètres dans %s

source: Your database configuration file is present.
fr: Votre fichier de configuration de la base de données est présent.

source: Your database configuration file is NOT present.
fr: Votre fichier de configuration de la base de données n'est PAS présent.

source: Rename %s to %s
fr: Renommez %s en %s

source: CakePHP is able to connect to the database.
fr: Cake est capable de se connecter à la base de données.

source: CakePHP is NOT able to connect to the database.
fr: Cake n'est PAS capable de se connecter à la base de données.

source: PCRE has not been compiled with Unicode support.
fr: PCRE n'as pas été compilé avec le support pour Unicode.

source: Recompile PCRE with Unicode support by adding <code>--enable-unicode-properties</code> when configuring
fr: Recompilez PCRE avec le support pour Unicode en ajoutant <code>--enable-unicode-properties</code> lors de la configuration

source: DebugKit plugin is present
fr: Le plugin DebugKit est présent

source: DebugKit is not installed. It will help you inspect and debug different aspects of your application.
fr: DebugKit n'est pas installé. Il vous aidera à inspecter et déverminer differents aspects de votre application.

source: You can install it from %s
fr: Vous pouvez l'installer depuis %s

source: Editing this Page
fr: Modifier cette Page

source: To change the content of this page, edit: %s.<br /> To change its layout, edit: %s.<br /> You can also add some CSS styles for your pages at: %s.
fr: Pour changer le contenu de cette page, modifiez : %s.<br /> Pour changer sa disposition, modifiez : %s.<br /> Vous pouvez aussi ajouter des styles CSS pour vos pages dans : %s.

source: Getting Started
fr: Commencer

source: New
fr: Nouveau

source: CakePHP 2.0 Docs
fr: CakePHP 2.0 Documentation

source: The 15 min Blog Tutorial
fr: Le tutoriel de 15 min du Blog

source: Official Plugins
fr: Plugins Officiels

source: provides a debugging toolbar and enhanced debugging tools for CakePHP applications.
fr: Fournit une barre d'outils de déverminage et des outils améliorés de déverminage pour les applications CakePHP.

source: contains various localized validation classes and translations for specific countries
fr: Contient plusieurs classes de validation localisées et traductions pour des pays spécifiques

source: More about CakePHP
fr: En savoir plus à propos de CakepPHP

source: CakePHP is a rapid development framework for PHP which uses commonly known design patterns like Active Record, Association Data Mapping, Front Controller and MVC.
fr: CakePHP est un framework de développement rapide pour PHP qui utilise des patrons de conception largement répandus comme Enregistrement Actif, Mise en Correspondance de Données par Association, Contrôleur Avant et MVC.

source: Our primary goal is to provide a structured framework that enables PHP users at all levels to rapidly develop robust web applications, without any loss to flexibility.
fr: Notre but premier est de fournir un framework structuré qui permet aux utilisateurs de PHP de tous les niveaux de développer rapidement de robustes applications web, sans aucune perte de flexibilité.

source: The Rapid Development Framework
fr: Le Framework de Développement Rapide

source: CakePHP Documentation
fr: Documentation de CakePHP

source: Your Rapid Development Cookbook
fr: Votre Livre de Cuisine pour le Développement Rapide

source: CakePHP API
fr: API CakePHP

source: Quick API Reference
fr: Référence Rapide pour l'API

source: The Bakery
fr: La Boulangerie

source: Everything CakePHP
fr: Tout sur CakePHP

source: CakePHP Plugins
fr: Plugins CakePHP

source: A comprehensive list of all CakePHP plugins created by the community
fr: Une liste complète de tous les plugins CakePHP créés par la communauté

source: CakePHP Community Center
fr: Centre Communautaire CakePHP

source: Everything related to the CakePHP community in one place
fr: Tout ce qui est lié à la communauté de CakePHP en un endroit

source: CakePHP Google Group
fr: Groupe Google CakePHP

source: Community mailing list
fr: Liste d'envoi CakePHP

source: Live chat about CakePHP
fr: Clavardage en direct à propos de CakePHP

source: CakePHP Code
fr: Code de CakePHP

source: Find the CakePHP code on GitHub and contribute to the framework
fr: Trouvez le code source de CakePHP sur GitHub et contribuez au framework

source: CakePHP Issues
fr: Problèmes de CakePHP

source: CakePHP Roadmaps
fr: Cartes de CakePHP

source: Training
fr: Formation

source: Join a live session and get skilled with the framework
fr: Rejoignez une session en direct et devenez plus habile avec le framework

source: Don't miss our annual CakePHP conference
fr: Ne manquez pas notre conférence annuelle CakePHP

source: Promoting development related to CakePHP
fr: Promouvoir le développement relié à CakePHP

source: Debug setting does not allow access to this url.
fr: Le paramètre debug n'autorise par l'accès à cette url.

source: Cache engine %s is not available.
fr: Le moteur de cache %s n'est pas disponible.

source: Cache engines must use %s as a base class.
fr: Les moteurs de cache doivent utiliser %s comme classe de base.

source: Cache engine %s is not properly configured.
fr: Le moteur de cache %s n'est pas correctement configuré.

source: %s cache was unable to write '%s' to %s cache
fr: La cache %s n'a pas été capable d'écrire '%s' dans la cache %s

source: Invalid cache group %s
fr: Groupe de cache %s Invalide

source: Files cannot be atomically decremented.
fr: Les fichiers ne peuvent pas être automatiquement décrémentés.

source: Files cannot be atomically incremented.
fr: Les fichiers ne peuvent pas être automatiquement incrémentés.

source: Could not apply permission mask "%s" on cache file "%s"
fr: Impossible d'appliquer le masque de permission "%s" sur le fichier de cache "%s"

source: %s is not writable
fr: %s n'est pas inscriptible

source: Method %s not implemented for compressed cache in %s
fr: La méthode %s n'est pas implémentée pour la cache compressée dans %s

source: Cannot load configuration files with ../ in them.
fr: Impossible de charger les fichiers de configurations contenant ../

source: Could not load configuration file: %s
fr: Impossible de charger le fichier de configuration : %s

source: No variable %s found in %s
fr: Aucune variable %s trouvée dans %s

source: Please install PHPUnit framework <info>(http://www.phpunit.de)</info>
fr: Veuillez installer le framework PHPUNIT <info>(http://www.phpunit.de)</info>

source: Test case %s cannot be run via this shell
fr: Le test %s ne peut pas être exécuté depuis le shell

source: Test case %s not found
fr: Le test %s est introuvable

source: %s modified
fr: %s modifié

source: Invalid object type.
fr: Type d'objet invalide

source: Invalid type name
fr: Nom de type invalide

source: Could not find %s.
fr: Impossible de trouver %s

source: AclComponent adapters must implement AclInterface
fr: Adaptateurs AclComponent doivent implémenter AclInterface

source: %s is deprecated, use %s instead
fr: %s est obsolète, utilisez %s à la place

source: Authorization adapter "%s" was not found.
fr: L'adaptateur d'autorisation "%s" est introuvable.

source: Authorization objects must implement an %s method.
fr: Les objets d'autorisation doivent implémenter une méthode %s.

source: Authentication adapter "%s" was not found.
fr: L'adaptateur d'authentification "%s" est introuvable.

source: Authentication objects must implement an %s method.
fr: Les objets d'authentification doivent implémenter une méthode %s.

source: You must use cipher or rijndael for cookie encryption type
fr: Vous devez utiliser cipher ou rijndael comme type d'encryption des cookies

source: You must give a handler callback.
fr: Vous devez fournir un rappel de gestionnaire.

source: The request has been black-holed
fr: La requête est tombée dans un trou noir

source: "roles" section not found in configuration.
fr: La section "roles" est introuvable dans la configuration.

source: Neither "allow" nor "deny" rules were provided in configuration.
fr: Ni les règles "allow" ou "deny" n'ont été fournies dans la configuration.

source: cycle detected when inheriting %s from %s. Path: %s
fr: cycle détecté en héritant %s depuis %s. Chemin : %s

source: Password hasher class "%s" was not found.
fr: La classe de hachage de mots de passe "%s" est introuvable.

source: Password hasher must extend AbstractPasswordHasher class.
fr: Le hacheur de mots de passe doit étendre la classe AbstractPasswordHasher.

source: $controller needs to be an instance of Controller
fr: $controller doit être une instance de Controller

source: $controller does not implement an %s method.
fr: $controller n'implémente pas la méthode %s.

source: CrudAuthorize::authorize() - Attempted access of un-mapped action "%1$s" in controller "%2$s"
fr: CrudAuthorize::authorize() - Tentative d'accès de l'action non cartographiée "%1$s" dans le contrôleur "%2$s"

source: Can't find application core file. Please create %s, and make sure it is readable by PHP.
fr: Le fichier noyau de l'application est introuvable. Veuillez créer %s, et assurez-vous qu'il est lisible par PHP.

source: Can't find application bootstrap file. Please create %s, and make sure it is readable by PHP.
fr: Le fichier de démarrage de l'application est introuvable. Veuillez créer %s, et assurez-vous qu'il est lisible par PHP.

source: There is no "%s" adapter.
fr: Il n'y a pas d'adaptateur "%s".

source: The "%s" adapter, does not have a %s method.
fr: L'adaptateur "%s" n'a pas de méthode %s.

source: The eventKey variable is required
fr: La variable eventKey est requise

source: You cannot use "" as a domain.
fr: Vous ne pouvez pas utiliser "" comme domaine.

source: Missing plural form translation for "%s" in "%s" domain, "%s" locale. Check your po file for correct plurals and valid Plural-Forms header.
fr: Traduction plurielle du formulaire introuvable pour "%s" dans le domaine "%s" de la locale "%s". Vérifiez votre fichier po pour les pluriels corrects et les formes plurielles valides des en-têtes.

source: Invalid key name
fr: Nom de clé invalide

source: Missing logger class name
fr: Nom de la classe de journalisation introuvable

source: Stream %s not found
fr: Flot %s introuvable

source: logger class %s does not implement a %s method.
fr: La classe de journalisation %s n'implémente pas une méthode %s.

source: Could not load class %s
fr: Impossible de charger la classe %s

source: Could not apply permission mask "%s" on log file "%s"
fr: Impossible d'appliquer le masque de permission "%s" sur le fichier journal "%s"

source: AclNode::node() - Couldn't find %s node identified by "%s"
fr: AclNode::node() - Impossible de trouver le noeud %s identifié par "%s"

source: %s - Method %s not found in any attached behavior
fr: %s - Impossible de trouver la méthode %s dans aucun des comportements attachés

source: Schema generation error: invalid column type %s for %s.%s does not exist in DBO
fr: Erreur de génération de schéma : type de colonne %s invalide pour %s.%s n'existe pas dans la DBO

source: (Model::getColumnTypes) Unable to build model field data. If you are using a model without a database table, try implementing schema()
fr: (Model::getColumnTypes) Impossible de construire les données de champs du modèle. Si vous utilisez un modèle sans une base de données, essayez d'implémenter schema()

source: Invalid join model settings in %s. The association parameter has the wrong type, expecting a string or array, but was passed type: %s
fr: Paramètres de modèle de jonction invalides dans %s. Le paramètre d'association n'a pas le bon type, une chaîne de caractères ou un tableau est attendu, mais le type passé est : %s

source: %s - Failed ARO/ACO node lookup in permissions check. Node references: Aro: %s Aco: %s
fr: %s - Échec de la recherche du noeud ARO/ACO lors de la vérification des permissions. Références du noeud : Aro: %s Aco: %s

source: %s - Failed ACO node lookup in permissions check. Node references: Aro: %s Aco: %s
fr: %s - Échec de la recherche du noeud ACO lors de la vérification des permissions. Références du noeud : Aro: %s Aco: %s

source: ACO permissions key %s does not exist in %s
fr: La clé de permissions ACO est introuvable dans %s

source: %s - Invalid node
fr: %s - Noeud invalide

source: Invalid permission key "%s"
fr: Clé de permissions invalide "%s"

source: Callback %s not defined in %s
fr: Le rappel %s n'est pas défini dans %s

source: AclBehavior is setup with more then one type, please specify type parameter for node()
fr: AclBehavior est configuré avec plus d'un type, veuillez spécifier le paramètre de type pour node()

source: Model "%s" is not associated with model "%s"
fr: Le modèle "%s" n'est pas associé avec le modèle "%s"

source: Datasource %s for TranslateBehavior of model %s is not connected
fr: La source de données %s pour TranslateBehavior du modèle %s n'est pas connectée

source: You cannot bind a translation named "name".
fr: Vous ne pouvez pas lier une traduction nommée "name".

source: Association %s is already bound to model %s
fr: L'association %s est déjà liée au modèle %s

source: Unable to configure the session, setting %s failed.
fr: Impossible de configurer la session, le paramètre %s a échoué.

source: Could not load %s to handle the session.
fr: Impossible de charger %s pour gérer la session.

source: Chosen SessionHandler does not implement CakeSessionHandlerInterface it cannot be used with an engine key.
fr: Le SessionHandler choisi n'implémente pas CakeSessionHandlerInterface. Il ne peut pas être utilisé avec une clé du moteur.

source: Selected driver is not enabled
fr: Le driver sélectionné n'est pas activé

source: Error in Model %s
fr: Erreur dans le Modèle %s

source: Invalid schema object
fr: Schéma d'objet invalide

source: Column name or type not defined in schema
fr: Nom de colonne ou type indéfini dans le schéma

source: Column type %s does not exist
fr: Le type de colonne %s n'existe pas

source: Could not describe table for %s
fr: Impossible de décrire la table pour %s

source: Could not find validation handler %s for %s
fr: Impossible de trouver le gestionnaire de validation %s pour %s

source: Method %s does not exist
fr: La méthode %s n'existe pas

source: Unknown status code
fr: Code de statut inconnu

source: Invalid status code
fr: Code de statut invalide

source: The requested file %s was not found or not readable
fr: Le fichier demandé %s n'a pas été trouvé ou n'est pas lisible

source: Connection timed out
fr: La connexion a expirée

source: Invalid encryption scheme chosen
fr: Le schème d'encryption choisi est invalide

source: Unable to perform enableCrypto operation on CakeSocket
fr: Impossible d'exécuter l'opération enableCrypto sur le CakeSocket

source: From requires only 1 email address.
fr: Le formulaire exige seulement 1 adresse courriel.

source: Sender requires only 1 email address.
fr: L'expéditeur exige seulement 1 adresse courriel.

source: Reply-To requires only 1 email address.
fr: Reply-To exige seulement 1 adresse courriel.

source: Disposition-Notification-To requires only 1 email address.
fr: Disposition-Notification-To exige seulement 1 adresse courriel.

source: Return-Path requires only 1 email address.
fr: Return-Path exige seulement 1 adresse courriel.

source: Invalid email: "%s"
fr: Courriel invalide : "%s"

source: $headers should be an array.
fr: $headers devrait toujours être un tableau.

source: Format not available.
fr: Format indisponible.

source: Class "%s" not found.
fr: La classe "%s" est introuvable.

source: The "%s" does not have a %s method.
fr: Le "%s" n'a pas de méthode %s.

source: Invalid format for Message-ID. The text should be something like "<uuid@server.com>"
fr: Format invalide pour Message-ID. Le texte devrait ressembler à "<uuid@server.com>"

source: No file or data specified.
fr: Aucune donnée ou fichier spécifié.

source: No filename specified.
fr: Aucun nom de fichier spécifié.

source: File not found: "%s"
fr: Fichier introuvable : "%s"

source: From is not specified.
fr: Le formulaire n'est pas spécifié.

source: You need to specify at least one destination for to, cc or bcc.
fr: Vous devez définir au moins une destination pour à, cc où bcc.

source: %s not found.
fr: %s introuvable.

source: Unknown email configuration "%s".
fr: Configuration de courriel incunnue "%s".

source: Could not send email.
fr: Impossible d'envoyer le courriel.

source: Unable to connect to SMTP server.
fr: Impossible de se connecter au serveur SMTP.

source: SMTP server did not accept the connection or trying to connect to non TLS SMTP server using TLS.
fr: Le serveur SMTP n'a pas accepté la connexion ou vous tentez de vous connecter à un serveur SMTP non-TLS en utilisant TLS.

source: SMTP server did not accept the connection.
fr: Le serveur SMTP n'a pas accepté la connexion.

source: SMTP server did not accept the username.
fr: Le serveur SMTP n'a pas accepté le nom d'usager.

source: SMTP server did not accept the password.
fr: Le serveur SMTP n'a pas accepté le mot de passe.

source: SMTP authentication method not allowed, check if SMTP server requires TLS
fr: La méthode d'authentification SMTP n'est pas permise, vérifiez si le serveur SMTP exige TLS

source: SMTP does not require authentication.
fr: SMTP n'exige pas d'authentification.

source: SMTP timeout.
fr: SMTP a expiré.

source: SMTP Error: %s
fr: Erreur SMTP : %s

source: HttpResponse is deprecated due to naming conflicts. Use HttpSocketResponse instead.
fr: HttpResponse est obselète en raison de conflits de nommage. Utilisez HttpSocketResponse à la place.

source: Invalid resource.
fr: Ressource invalide.

source: Class %s not found.
fr: Classe %s introuvable.

source: Unknown authentication method.
fr: Méthode d'authentification inconnue.

source: The %s does not support authentication.
fr: Le %s ne supporte pas l'authentification.

source: Unknown authentication method for proxy.
fr: Méthode d'authentification inconnue pour le proxy.

source: The %s does not support proxy authentication.
fr: Le %s ne supporte pas l'authentification par proxy.

source: HttpSocket::_buildRequestLine - Passed an invalid request line string. Activate quirks mode to do this.
fr: HttpSocket::_buildRequestLine - Une chaîne de ligne de requête invalide a été passée. Vous devez activer le mode quirks pour faire cela.

source: HttpSocket::_buildRequestLine - The "*" asterisk character is only allowed for the following methods: %s. Activate quirks mode to work outside of HTTP/1.1 specs.
fr: HttpSocket::_buildRequestLine - Le caractère astérisque "*" est seulement permis pour les méthodes suivantes : %s. Activez le mode quirks pour travailler en dehors des spécifications de HTTP/1.1.

source: Invalid response.
fr: Réponse invalide.

source: Invalid HTTP response.
fr: Réponse HTTP invalide.

source: HttpSocket::_decodeChunkedBody - Could not parse malformed chunk.
fr: HttpSocket::_decodeChunkedBody - Impossible de faire l'analyse d'un chunk malformé.

source: Route class not found, or route class is not a subclass of CakeRoute
fr: La classe Route est introuvable, ou la classe route n'est pas une classe enfant de CakeRoute

source: No unit type.
fr: Aucun type d'unité.

source: (ClassRegistry::init() Attempted to create instance of a class with a numeric name
fr: (ClassRegistry::init() a tenté de créer une instance d'une classe avec un nom numérique

source: Cannot create instance of %s, as it is abstract or is an interface
fr: Impossible de créer une instance de %s, puisque c'est abstrait ou que c'est une interface

source: (ClassRegistry::init() could not create instance of %s
fr: (ClassRegistry::init() n'a pas pu créer une instance de %s

source: Invalid Debugger output format.
fr: Format de sortie invalide du dévermineur.

source: Please change the value of %s in %s to a salt value specific to your application.
fr: Veuillez changer la valeur de %s dans %s pour une valeur salt spécifique à votre application.

source: Please change the value of %s in %s to a numeric (digits only) seed value specific to your application.
fr: Veuillez changer la valeur de %s dans %s pour une valeur seed numérique (chiffres seulement) spécifique à votre application.

source: %s changed to %s
fr: %s changé en %s

source: %s NOT changed to %s
fr: %s n'a PAS été changé en %s

source: %s is a file
fr: %s est un fichier

source: %s created
fr: %s créé

source: %s NOT created
fr: %s n'a PAS été créé

source: %s removed
fr: %s supprimé

source: %s NOT removed
fr: %s n'a PAS été supprimé

source: %s not found
fr: %s est introuvable

source: %s not writable
fr: %s n'est pas inscriptible

source: %s copied to %s
fr: % copié vers %s

source: %s NOT copied to %s
fr: %s n'a PAS été copié vers %s

source: %s not created
fr: %s n'a PAS été créé

source: Hash::combine() needs an equal number of keys + values.
fr: Hash::combine() a besoin d'un nombre égal de clés + valeurs

source: Cannot use modParams with indexes that do not exist.
fr: Impossible d'utiliser modParams avec des indices qui n'existent pas.

source: Invalid value, cost must be between %s and %s
fr: Valeur invalide, le coût doit être entre %s et %s

source: You cannot use an empty key for %s
fr: Vous ne pouvez pas utiliser une clé vide pour %s

source: You must specify the operation for Security::rijndael(), either encrypt or decrypt
fr: Vous devez spécifier l'opération pour Security::rijndael(), soit encrypt ou decrypt

source: You must use a key larger than 32 bytes for Security::rijndael()
fr: Vous devez utiliser une clé de plus de 32 octets pour Security::rijndael()

source: Invalid salt: %s for %s Please visit http://www.php.net/crypt and read the appropriate section for building %s salts.
fr: Salt invalide : %s pour %s Veuillez visiter http://www.php.net/crypt et lire la section appropriée pour construire des salts %s.

source: You must define the $operator parameter for %s
fr: Vous devez définir le paramètre $operator pour %s

source: You must define a regular expression for %s
fr: Vous devez définir une expression régulière pour %s

source: Could not find %s class, unable to complete validation.
fr: Impossible de trouver la classe %s, impossible de compléter la validation.

source: Method %s does not exist on %s unable to complete validation.
fr: La méthode %s n'existe pas sur %s, impossible de compléter la validation.

source: Can not determine the mimetype.
fr: Impossible de déterminer le mimetype.

source: XML cannot be read.
fr: Impossible de lire le XML.

source: Invalid input.
fr: Entrée de données invalide.

source: Xml cannot be read.
fr: Impossible de lire le Xml.
