Repository: cakephp-fr/locale-2.x
Catalog: fra/LC_MESSAGES/cake_dev.po
Languages: fr

source: The key of input must be alphanumeric
fr: La clé de l'entrée de données doit être alphanumérique

source: Invalid array
fr: Tableau invalide

source: The input is not instance of SimpleXMLElement, DOMDocument or DOMNode.
fr: L'entrée de données n'est pas une instance de SimpleXMLElement, DOMDocument ou de DOMNode.

source: Method %1$s::%2$s does not exist
fr: La méthode %1$s::%2$s n'existe pas

source: Element Not Found: %s
fr: Élément introuvale : %s

source: You cannot extend an element which does not exist (%s).
fr: Vous ne pouvez pas étendre un élément qui n'existe pas (%s).

source: You cannot have views extend themselves.
fr: Vous ne pouvez pas avoir de vues qui s'étendent elles-mêmes.

source: You cannot have views extend in a loop.
fr: Vous ne pouvez pas avoir de vues qui s'entendent en boucle.

source: The "%s" block was left open. Blocks are not allowed to cross files.
fr: Le block "%s" a été laissé ouvert. Les blocks ne sont pas authorisés à traverser les fichiers.

source: Encountered unexpected %s. Cannot generate SQL log.
fr: Rencontre inattendue de %s. Impossible de générer un journal SQL.

source: Fatal Error
fr: Erreur Fatale

source: Error
fr: Erreur

source: File
fr: Fichier

source: Line
fr: Ligne

source: Notice
fr: Avis

source: If you want to customize this error message, create %s
fr: Si vous voulez personnaliser ce message d'erreur, créez %s

source: Missing Method in %s
fr: Méthode manquante dans %s

source: The action %1$s is not defined in controller %2$s
fr: L'action %1$s n'est pas définie dans le contrôleur %2$s

source: Create %1$s%2$s in file: %3$s.
fr: Créez %1$s%2$s dans le fichier : %3$s.

source: Missing Behavior
fr: Comportement Manquant

source: %s could not be found.
fr: %s est introuvable.

source: Create the class %s below in file: %s
fr: Créez la classe %s ci-dessous dans le fichier %s

source: Missing Component
fr: Composant Manquant

source: Missing Database Connection
fr: Connexion à la Base de Données Manquante

source: A Database connection using "%s" was missing or unable to connect.
fr: Une connexion à la base de données utilisant "%s" était manquante ou la connexion a échouée.

source: The database server returned this error: %s
fr: Le serveur de la base de données a retourné cette erreur : %s

source: %s driver is NOT enabled
fr: Le driver %s n'est PAS activé

source: Missing Controller
fr: Contrôleur Manquant

source: Scaffold requires a database connection
fr: L'échafaud exige une connexion à la base de données

source: Confirm you have created the file: %s
fr: Confirmez que vous avez créé ce fichier : %s

source: Missing Datasource
fr: Source de données Manquante

source: Datasource class %s could not be found.
fr: La classe de source de données %s est introuvable.

source: Missing Datasource Configuration
fr: Configuration de la Source de Données Manquante

source: The datasource configuration %1$s was not found in database.php.
fr: La configuration de la source de données %1$s est introuvable dans database.php.

source: Missing Helper
fr: Helper Manquant

source: Missing Layout
fr: Layout Manquant

source: The layout file %s can not be found or does not exist.
fr: Le fichier de layout %s est introuvable ou n'existe pas.

source: Missing Plugin
fr: Plugin Manquant

source: The application is trying to load a file from the %s plugin
fr: L'application tente de charger un fichier du plugin %s

source: Make sure your plugin %s is in the %s directory and was loaded
fr: Assurez-vous que votre plugin %s est dans le répertoire %s et a été chargé

source: Loading all plugins
fr: Chargement de tous les plugins

source: If you wish to load all plugins at once, use the following line in your %s file
fr: Si vous souhaitez charger tous les plugins en même temps, utilisez la ligne suivante dans votre fichier %s

source: Missing Database Table
fr: Table de Base de Données Manquante

source: Table %1$s for model %2$s was not found in datasource %3$s.
fr: La table %1$s du modèle %2$s est introuvable dans la source de données %3$s.

source: Missing View
fr: Vue Manquante

source: The view for %1$s%2$s was not found.
fr: La vue pour %1$s%2$s est introuvable

source: Database Error
fr: Erreur de Base de Données

source: SQL Query
fr: Requête SQL

source: SQL Query Params
fr: Paramètres de la Requête SQL

source: Private Method in %s
fr: Méthode Privée dans %s

source: %s%s cannot be accessed directly.
fr: %s%s ne peut pas être accédé directement.

source: Scaffold Error
fr: Erreur d'Échafaud

source: Method _scaffoldError in was not found in the controller
fr: La méthode _scaffoldError est introuvable dans le contrôleur

source: Unable to write view cache file: "%s" for "%s"
fr: Impossible d'écrire le fichier de cache de la vue : "%s" pour "%s"

source: Missing field name for FormHelper::%s
fr: Nom de champs manquant pour FormHelper::%s

source: Cannot load the configuration file. Wrong "configFile" configuration.
fr: Impossible de charger le fichier de configuration. Mauvaise configuration "configFile".

source: Cannot load the configuration file. Unknown reader.
fr: Impossible de charger le fichier de configuration. Lecteur inconnu.

source: JsHelper:: Missing Method %s is undefined
fr: JsHelper:: La méthode manquante %s est indéfinie

source: %s requires a "drag" option to properly function
fr: %s exige une option "drag" pour fonctionner correctement

source: %s could not be found
fr: %s est introuvable

source: %s does not implement a %s method, it is incompatible with %s
fr: %s n'implémente pas une méthode %s, c'est incompatible avec %s
